app/views/posts/show.html.erb

      <p>
        <i class="tiny material-icons">perm_identity</i><strong><a class="blue-text text-darken-3" href="/users/<%= @post.user_id %>"> <%= @post.user.first_name %> <%= @post.user.last_name %></a><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]