app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @city = City.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 7]]
---
  def show

    @post = Post.find(params[:id])
    @user = User.find(params[:id])
    @city = City.find(params[:id])
    @posts = City.find(params[:id]).posts

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
---
  def posts
    @posts = City.find(params[:id]).posts