app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "location", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if current_user == @user
      @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Mike"], ["last_name", "Cheng"], ["updated_at", "2016-06-22 02:46:29.329623"], ["id", 3]]

  def posts
    @posts = User.find(params[:id]).posts
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]