app/views/cities/show.html.erb

            <h4><i class="tiny material-icons white-text">message</i><a href="/cities/<%= @city.id %>/posts/<%= post.id %>" class="button-link">  <%= post.title %></h4></a>
            <i class="tiny material-icons white-text">perm_identity</i><strong><a href="/users/<%= post.user_id %>" class="button-link">  <%= post.user.first_name %> <%= post.user.last_name %></a></strong></br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]